
export const COMMON_EXERCISES = [
  "Тяга нижнего блока",
  "Тяга блинами на спину",
  "Жим гантелей 15°",
  "Сведение в гравитроне на грудь",
  "Разгибания на переднюю бедра",
  "Сгибания на заднюю бедра лёжа",
  "Жим 45°",
  "Бабочка в гравитроне",
  "Присед",
  "Выпады",
  "Тяга верхнего блока",
  "Жим лёжа",
  "Бабочка",
  "Мост"
];

export const PRESET_WORKOUTS = [
  {
    name: "КОНСКАЯ ТРЕНИРОВКА 1",
    exercises: [
      { name: "Тяга нижнего блока / Тяга блинами на спину", setsCount: 4 },
      { name: "Жим гантелей 15°", setsCount: 4 },
      { name: "Сведение в гравитроне на грудь", setsCount: 3 },
      { name: "Разгибания на переднюю бедра", setsCount: 3 },
      { name: "Сгибания на заднюю бедра лёжа", setsCount: 3 }
    ]
  },
  {
    name: "КОНСКАЯ ТРЕНИРОВКА 2",
    exercises: [
      { name: "Тяга с блинами на спину", setsCount: 4 },
      { name: "Жим 45°", setsCount: 4 },
      { name: "Бабочка в гравитроне", setsCount: 4 },
      { name: "Присед", setsCount: 4 },
      { name: "Выпады вместо приседа", setsCount: 3 }
    ]
  },
  {
    name: "КОНСКАЯ ТРЕНИРОВКА 3",
    exercises: [
      { name: "Тяга верхнего блока", setsCount: 4 },
      { name: "Жим лёжа", setsCount: 5 },
      { name: "Бабочка", setsCount: 3 },
      { name: "Мост", setsCount: 3 }
    ]
  }
];

